# Введення користувача розміру квадратної матриці
nRows = int(input("Введіть розмір квадратної матриці: "))

# Ініціалізація пустого списку для матриці
arr = []

# Цикл для побудови квадратної матриці зі зменшенням кількості стовпців
for i in range(nRows):
    arr.append([''] * (nRows - i))

# Запит користувача ввести символ-заповнювач
filler = input("Введіть символ-заповнювач: ")

# Початковий пробіл для форматування виводу
spacing = 0

# Відкриття файлу для запису результату матриці
with open("MyFile.txt", "w") as fout:
    # Цикл для кожного рядка у матриці
    for i in range(nRows):
        # Додання пробілів ліворуч від кожного рядка для форматування
        for s in range(spacing):
            print(" ", end=' ')
            fout.write(" ")

        # Перевірка довжини символу-заповнювача
        if len(filler) == 1:
            # Цикл для заповнення матриці символом-заповнювачем
            for j in range(nRows - i):
                arr[i][j] = filler[0]
                print(arr[i][j], end=' ')
                fout.write(arr[i][j] + " ")
        # Обробка випадків, коли не введено символ або введено більше одного символу
        elif len(filler) == 0:
            print("\nСимвол-заповнювач не введено")
            break  # Вихід із циклу
        else:
            print("\nЗанадто багато символів-заповнювачів")
            break  # Вихід із циклу

        print()
        fout.write("\n")
        spacing += 2  # Збільшення пробілу для кожного рядка

    fout.flush()  # Збереження виводу в файл
